app/controllers/api/v1/fish_spots_controller.rb

    def destroy
        fish_id = @fish_spot.fish_id
        fishing_spot = @fish_spot.fishing_spot_id
        @fish_spot.destroy()
---
DELETE FROM "fish_spots" WHERE "fish_spots"."id" = $1  [["id", 51]]

    def find_fish_spot
        @fish_spot = FishSpot.find_by(id: params[:id])
---
SELECT "fish_spots".* FROM "fish_spots" WHERE "fish_spots"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]