app/controllers/api/v1/fish_controller.rb

SELECT "fish".* FROM "fish"
---
    def index
        @fish = Fish.all

UPDATE "fish" SET "is_active" = $1, "updated_at" = $2 WHERE "fish"."id" = $3  [["is_active", true], ["updated_at", "2020-05-26 07:47:07.456761"], ["id", 83]]
---
    def update
        @fish.update(fish_params)

UPDATE "fish" SET "is_active" = $1, "updated_at" = $2 WHERE "fish"."id" = $3  [["is_active", false], ["updated_at", "2020-05-26 07:43:44.912139"], ["id", 83]]
---
    def destroy
        @fish.is_active = false
        if(@fish.save())

SELECT "fish".* FROM "fish" WHERE "fish"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]
---
    def find_fish
        @fish = Fish.find_by(id: params[:id])