app/controllers/api/v1/fishing_spots_controller.rb

SELECT "fishing_spots".* FROM "fishing_spots"
---
    def index
        @fishing_spots = FishingSpot.all

SELECT "fishing_spots".* FROM "fishing_spots" WHERE "fishing_spots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_fishing_spot
        @fishing_spot = FishingSpot.find_by(id: params[:id])