app/controllers/fish_controller.rb

    def index
        @fish = Fish.all
---
SELECT "fish".* FROM "fish"

    def create
        @fish = Fish.create(fish_params)
---
INSERT INTO "fish" ("species", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["species", "Create Test"], ["description", "Testing ability to create"], ["created_at", "2020-05-25 10:42:22.922279"], ["updated_at", "2020-05-25 10:42:22.922279"]]

    def update
        @fish.update(fish_params)
---
UPDATE "fish" SET "description" = $1, "updated_at" = $2 WHERE "fish"."id" = $3  [["description", "Testing ability to update"], ["updated_at", "2020-05-25 10:43:40.759765"], ["id", 1]]

    def find_fish
        @fish = Fish.find_by(id: params[:id])
---
SELECT "fish".* FROM "fish" WHERE "fish"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]