app/controllers/fishing_spots_controller.rb

    def index
        @fishing_spots = FishingSpot.all
---
SELECT "fishing_spots".* FROM "fishing_spots"